docs/Blogs/wsite-jul24.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I built my Academic Website Using Emacs Org-mode</title>
<meta name="author" content="Nidish Narayanaa Balaji" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="../css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">How I built my Academic Website Using Emacs Org-mode</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b5e0b5"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-15 Mon&gt; </span></span> How I built my Academic Website Using Emacs Org-mode</a>
<ul>
<li><a href="#org476f9c7">Some background</a></li>
<li><a href="#orgb64cfb6">A Brief Overview of my Static Site Creation Process</a></li>
<li><a href="#orge33defb">Outro</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1b5e0b5" class="outline-2">
<h2 id="org1b5e0b5"><span class="timestamp-wrapper"><span class="timestamp">&lt;2024-07-15 Mon&gt; </span></span> How I built my Academic Website Using Emacs Org-mode</h2>
<div class="outline-text-2" id="text-org1b5e0b5">
<p>
Now that I'm starting as an Assistant Professor at IIT-M (Dept. of
Aerospace Engg.), I feel it makes sense for me to have a personal/lab
website.
</p>

<p>
As a student I always appreciated it when my professors had
a decently updated website online that I can use to read about his/her
work. More than anybody else, my website is aimed primarily to attract
prospective students. I will try to consciously maintain the website
and keep it up to date so students can get an idea of the
research/teaching I'm involved in.
</p>

<div style="left:76vw;max-width:23vw;" class="rmargin" id="org5ba8fb5">
<p>
<span class="underline"><b>An interesting design-thought</b></span>
</p>

<p>
Don't we sometimes feel that images are a little distracting while
reading something serious?
</p>

<p>
<span class="underline">I contest</span> that the side-margin is the best place to put images and
other content that can be viewed/read without affecting the flow of
the rest of the document.
</p>

<p>
Exceptions, of course, exist and this is not a universal rule, but
proper utilization of margin spaces, at least on a web-interface,
looks like it can improve information presentation. I plan to test
this idea out on this blog!
</p>

</div>
<p>
This short blog post is not intended to be tutorial of any merit since
there are more than enough out there already. This is merely meant to
be a verbose description of the thinking and process that went behind
the site. 
</p>
</div>

<div id="outline-container-org476f9c7" class="outline-3">
<h3 id="org476f9c7">Some background</h3>
<div class="outline-text-3" id="text-org476f9c7">
<p>
<span class="underline">You can safely skip this section if you're only here for the
technical content.</span>
</p>

<p>
Being an Emacs user of ~8 years, I am now completely convinced of
using <a href="https://orgmode.org/">Org-mode</a> for "seamless" web development. Although I have pretty
decent programming skills, all of these have so far been oriented
towards scientific programming and I have never cared to learn much in
the way of web-development.
</p>

<p>
I started learning the basics of html-css-javascript and realized
there's <span class="underline">really nothing to learn</span>, as far as my purposes (hosting a
static website) and I could just get started already. The first thing
I had to understand was the whole html-css-javascript
framework. Learning a little bit of vanilla javascript was
helpful. And &lt;f12&gt; on modern web browsers gives basically all we need
in terms of an interactive environment for development.
</p>
</div>
</div>

<div id="outline-container-orgb64cfb6" class="outline-3">
<h3 id="orgb64cfb6">A Brief Overview of my Static Site Creation Process</h3>
<div class="outline-text-3" id="text-orgb64cfb6">
<div class="lmargin" id="org5f09e25">
<p>
On top of the Makefile, <span class="underline"><b>being in the Emacs environment affords me so
many more luxuries</b></span>: 
</p>
<ul class="org-ul">
<li>Building the site is just two key strokes away (I've bound the
<code>compile</code> elisp function)</li>
<li>I can add images, tables, etc., and refer to them consistently
(links go to the appropriate lines of the source in emacs, and to
the approprate portion of the page on the browser);</li>
<li>Math formatting, source code blocks, etc. etc., the list goes on.</li>
<li><p>
Using the 'html5' <a href="https://www.gnu.org/software/emacs/manual/html_node/org/HTML-doctypes.html">doctype</a> for the export lets me insert new class
divs using #+begin_ and #+end_ macros.
</p>

<p>
The best part is that everything is free (<a href="https://www.fsf.org/">as in freedom</a>)! I don't
need to outsource the maintenance of the website and it's easy
enough that I can do it myself.
</p></li>
</ul>

</div>
<p>
Since I'm not really interested in creating completely new
css-javascript styling, I am using <a href="https://github.com/fniessen/org-html-themes">the amazing work</a> by user fniessen
on Github as a springing board. I specifically love the Bigblow theme
and decided to modify the css to suit my needs appropriately.
</p>

<p>
I followed <a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">this tutorial</a> by <a href="https://daviwil.com/">David Wilson</a> (who I discovered online from
his <a href="https://www.youtube.com/@SystemCrafters">System Crafters</a> Youtube channel) to create a basic build system
using emacs. Since I ended up having to do a bunch of css and
javascript editing, I wrapped up everything in a <a href="https://github.com/Nidish96/my-home-page/blob/main/Makefile">GNU Makefile</a> that
simplifies my build process even further. 
</p>

<div style="left:76vw;max-width:23vw;" class="rmargin" id="org02a2a2d">
<p>
I was also told that <span class="underline"><b>using javascript frameworks is the way people
develop fancy websites these days</b></span>. I didn't feel a need for this in my
workflow and with the interest of keeping things simple, both for
development and maintenance, I've decided against it. The only
"framework" I'm using is <a href="https://jquery.com/">jquery</a> and a few plugins. 
</p>

</div>
<p>
Modification of the CSS ended up being the most frustrating part of
the process - thankfully a good highschool friend of mine, <span class="underline">Arjun Ram</span>
(who works at <a href="https://carmen.sg/">Carmen Automotives pvt ltd.</a>), gave me a hand at
this. This is the part that felt like it really requires "knowledge" -
most of everything else can be hacked at quite simply. I must also
mention that I made liberal use of the LLM search <a href="https://www.perplexity.ai/">perplexity</a> which I
found quite helpful for javascript. For CSS however, I got nearly
nothing of value from the LLM searches.
</p>

<p>
Once this was done, I was able to use javascript quite easily to put
together the features I needed. Bigblow uses <a href="https://jquery.com/">jquery</a> and a few plugins
by default, so I'm sticking with this. I also found <a href="https://github.com/pcooksey/bibtex-js">BibTeX-js</a>, a
javascript library that parses bib files to create organized and
searchable lists of publications (<a href="index.html#sec-publications">see the output here</a>).
</p>

<p>
The main additions I've added are:
</p>
<ul class="org-ul">
<li>Some javascript code to underline occurrences of my name in the
publication list;</li>
<li>"lmargin" and "rmargin" classes to put content in the left and right
margins (an inspiration from <a href="https://edwardtufte.github.io/tufte-css/">Edward Tufte</a>);</li>
<li>Setting up a "profile card" for students (this possibly requires
more tuning);</li>
<li>Transient highlighting of the target of a link once clicked.</li>
</ul>
</div>
</div>

<div id="outline-container-orge33defb" class="outline-3">
<h3 id="orge33defb">Outro</h3>
<div class="outline-text-3" id="text-orge33defb">
<p>
Obviously what I have so far is very rudimentary in terms of styling,
but I have a pretty organic feel about it. I hope I continue
maintiaining it and it really serves the purpose I want it to.
</p>

<p>
I've created <a href="index.html">a lab website</a> and <a href="personal.html">this personal website</a>. I hope to keep
the former updated with my academic activities and use this for
personal blogs and writing in general.
</p>

<p>
Last but not the least, I'm hosting the source files for the website
on Github <a href="https://github.com/Nidish96/my-home-page/blob/main/Makefile">here</a>. I hope it will help at least one more person! :-) 
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer">
 				   <ul>
<li><a href="/sitemap.html" title="Sitemap">Sitemap</a></li>
 				   <li><a href="mailto:nidish@iitm.ac.in" title="Email me at nidish@iitm.ac.in !">Contact</a></li>
 				   <li><a href="/personal.html#blog-creation" title="CSS"> 				   Like this CSS?</a></li>
 				   </ul>
 </div>

 				   <p class="creator" style="font-size:9px;">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15).</p>
 				   <p class="date">Last updated: 2024-07-25.</p>
</div>
</body>
</html>
